import React, { useEffect } from 'react'
import { observer } from 'mobx-react'
import poster from 'sources/images/main.jpg'

//components
import { Layout } from 'antd'
// style
import styles from './styles.module.scss'
/* 
const { Header, Sider, Content } = Layout */

const Main: React.FC = observer(() => {
  return (
    <div className={styles.wrapper}>
      <img src={poster} alt="" className={styles.image} />
      <div className={styles.quoteBlock}>
        <p>
          <i>
            <q>
              Сакура стара — <br />
              невже справді зацвіла?
              <br />
              Спогад, ніби дим...
            </q>
            <br />
            <b className={styles.quote}>Мацуо Басьо</b>
          </i>
          <br />
        </p>
      </div>
      <p>
        Традиційне мистецтво Японії дуже самобутнє, його філософські та естетичні принципи
        відрізняються від західних. На формування вплинуло особливе ставлення японців до краси
        рідної природи, з давнини сприймалася як досконалість, створена Богом.
      </p>
      <p>
        Японська літературна традиція вважається однією з найдавніших. Ранні письмові твори
        відносяться до VIII ст. Виникнення їх пов'язане із запозиченням китайської ієрогліфічної
        писемності.
      </p>
      <p>
        Першими писемними пам'ятками японської літератури є збори японських міфів та переказів про
        діяння богів та легендарних героїв. VIII ст. вважається розквітом придворної літератури
        (прози та поезії).
      </p>
      <p>
        Класичним жанром японської поезії вважаються вірші, які називаються «коротким віршем», які
        складаються з 5 рядків (31 склад – розподіл за рядками 5-7–5-7-7).
      </p>
      <p>
        У XVII ст. велику популярність здобули легенди, притчі та оповідання, що виникли в усній
        формі. Тоді ж оформляється авторська проза. Головним жанром довгий час були гесаку - жанрові
        розважальні оповідання, основним змістом яких були кумедні історії з навколишнього життя.
      </p>
      <p>
        Естетичні принципи японського мистецтва сформувалися під впливом трьох найважливіших
        релігійно-філософських доктрин, які визначили традиційну думку жителів Країни висхідного
        сонця:
      </p>
      <ol>
        <li value={1}>  синтоїзму;</li>
        <li> конфуціанства;</li>
        <li>  буддизму.</li>
      </ol>
      <p>
        Вшанування природи як божественного початку оформилося у давню національну релігію японців –
        синто. Спочатку у кожного клану були свої власні божества-покровителі, однак офіційний
        синтоїстський пантеон склався з божеств-покровителів клану Ямато.
      </p>
      <p>
        Конфуціанство, як і буддизм, прийшло до Японії з Китаю. Під конфуціанством зазвичай
        розуміється традиційна давньокитайська релігійно-філософська доктрина, яка зводила етичні
        засади в розряд світових законів.
      </p>
      <p>
        Важливу роль розвитку традиційного японського мистецтва зіграв буддизм. В основі буддійської
        філософії лежить уявлення про те, що так званий реальний світ (сансара) – насправді людська
        ілюзія, що виникла через нерозуміння суті речей.
      </p>{' '}
      <p>
        Традиційна японська естетика, що поєднує синтоїстські, конфуціанські та буддійські ідеали,
        розробила особливі принципи, розуміння яких є ключем до японського мистецтва.
      </p>
    </div>
  )
})

export default Main
