import React from 'react'
import { observer } from 'mobx-react'

//components
import { headerTitles, tableData } from 'utils/authorsTableData'

//images
import ryu from 'sources/images/ryunoske.jpg'
import kobo from 'sources/images/kobo.jpg'
import yasu from 'sources/images/yasu.jpg'
import yukio from 'sources/images/yukio.jpg'

// style
import styles from './styles.module.scss'

const Authors: React.FC = observer(() => {
  return (
    <div className={styles.wrapper}>
      <h2>Автори японської літератури</h2>
      <br />
      <div>
        <p>
        <img src={yukio} alt="" className={styles.imageR} />
          <h4>
            <b>Юкіо Місіма</b>
          </h4>
          Юкіо Місіма – яскравий представник японської літератури ХХ століття. На честь дня
          народження великого письменника - добірка значних японських авторів різних років для тих,
          хто хоче краще знати та розуміти різнопланову японську літературу. Почнемо з іменинника –
          Юкіо Місіма. Тричі був номінований на Нобелівську премію, між іншим. У юності за бажання
          батька спраглий літературних успіхів юнак отримав юридичну освіту і вступив на державну
          службу, але незабаром зміг залишити зненавиджену роботу заради літератури – це сталося
          після того, як скандальний роман «Сповідь маски» наробив галасу в літературному середовищі
          Японії. Чудові за красою та глибиною романи та класичні п'єси для театрів Але й Кабукі
          письменнику вдавалося поєднувати зі спробами державного перевороту та культом власного
          тіла, вишколеного виснажливими тренуваннями. Все це зрештою закінчилося самурайською
          смертю - Юкіо Місіма зробив харакірі, а два його соратники відрубали Місіме голову, як
          слід було за ритуалом.
        </p>

        <p>
        <img src={yasu} alt="" className={styles.imageL} />
          <h4>
            <b>Ясунарі Кавабата</b>
          </h4>
          Згадуючи Юкіо Місіму, не можна не згадати класика японської літератури
          та лауреата Нобелівської премії Кавабату, якого юний Юкіо свого часу звертався за порадою.
          Перу Кавабати належать такі романи, як «Стогін гори» і «Тисячокрилий журавель», «Стара
          столиця» та «Мейдзін», який для письменника був особливо дорогий. Особливістю письменника
          була дивовижна здатність гармонійно поєднувати вікові японські традиції та сучасний
          літературний стиль.
        </p>

        <p>
        <img src={kobo} alt="" className={styles.imageR} />
          <h4>
            <b>Кобо Абе</b>
          </h4>
          Абсурдний, дивний, чуйний і допитливий – цього письменника сам Кендзабуро Ое
          порівнював із Францом Кафкою. І справді, як і в Кафки, у творчості Кобо Абе основною темою
          був пошук свого героями творів. Часто цей пошук ставав сюрреалістичним і навіть абсурдним,
          але ніколи не скочувався до банальної розважальної літератури. Найбільші досягнення автора
          – це «Жінка в пісках», «Четвертий льодовиковий період», «Спалена карта»,
          «Людина-скринька».
        </p>

        <p>
          <img src={ryu} alt="" className={styles.imageL} />
          <h4>
            <b>Рюноске Акутагава</b>
          </h4>
          Життя цього письменника з самого початку нагадувало трилер із домішкою жахливого сну. Мати
          Акутагави наклала на себе руки в божевільні, та й сам письменник протягом усього життя
          (особливо в останні роки) не міг похвалитися відмінним психічним здоров'ям. Його численні
          оповідання та новели, що стали свого роду добірними перлами японської літератури, вражають
          красою деталей та мови, одночасно лякаючи темрявою, яка стоїть за кожним сюжетом.
        </p>
      </div>
      <div> </div>
      <table className={styles.table}>
        <thead className={styles.header}>
          {headerTitles.map((title, index) => (
            <th key={index} className={styles.title}>
              {title}
            </th>
          ))}
        </thead>
        <tbody className={styles.body}>
          {tableData.map((genre: any) => (
            <tr className={styles.row}>
              {Object.keys(genre).map((key, index): any => {
                return (
                  <td key={index} className={styles.item}>
                    {key !== 'writings'
                      ? genre[key]
                      : genre[key].map((wr: any) => <a href={wr.url} target="_blank"> "{wr.title}" </a>)}
                  </td>
                )
              })}
            </tr>
          ))}
        </tbody>
      </table>
    </div>
  )
})

export default Authors
