export const headerTitles = ['№','Жанр', 'Опис']

export const tableData = [
  {
    id: 1,
    title: 'Моноґатарі',
    desc: 'Епічний, як правило, прозовий твір класичної за винятком автобіографічної літератури, щоденників та есе. Традиційно перекладається як «повість», рідше як «роман», «оповідання» або «новела».',
  },
  {
    id: 2,
    title: 'Танка',
    desc: "П'ятивірш, що складається із чергування п'яти- та семискладових рядків (5—7—5—7—7). Заключні, завершальні рядки танка називаються аґеку.",
  },
  {
    id: 3,
    title: 'Хайку',
    desc: 'Трирядковий неримований вірш на основі першої півстрофи танка, що складається з 17 складів (5-7-5) і відрізняється простотою поетичної мови, свободою викладу.',
  },
  {
    id: 4,
    title: 'Ґункі',
    desc: "«Військові хроніки», «самурайські хроніки», «самурайські літописи» — жанр японської літератури XII—XVIІ століть. Основні сюжети пов'язані з війною і життям військових.",
  },
  {
    id: 5,
    title: 'Ракуґо',
    desc: 'Літературний і театральний жанр, створений в XVI—XVII століттях. Означає комічну розповідь або анекдот.',
  },
]
