import React, { useEffect } from 'react'
import { observer } from 'mobx-react'
import poster from 'sources/images/main.jpg'

//components
import { Layout } from 'antd'
// style
import styles from './styles.module.scss'
/* 
const { Header, Sider, Content } = Layout */

const historyObject = {}

const History: React.FC = observer(() => {
  return (
    <div className={styles.wrapper}>
      <nav>
        <h2>Історія японської літератури</h2>
        <ol>
          <li>
            <a href="#period">Періодизація</a>
          </li>
          <li>
            <a href="#history">Історія</a>
          </li>
          <ol>
            <li>
              <a href="#steer">Давня література</a>
            </li>
            <li>
              <a href="#bunny">Зайка</a>
            </li>
            <li>
              <a href="#bear">Мишка</a>
            </li>
          </ol>
          <li>
            <a href="#dva">Стихи</a>
          </li>
          <ol>
            <li>
              <a href="#r">Буква «Р»</a>
            </li>
            <li>
              <a href="#bullfinch">Снегирь</a>
            </li>
          </ol>
        </ol>
      </nav>
      <h2 id="period"><b>Періодизація</b></h2>
      <p>
        Нижче наведена періодизація японської літератури, прив'язана до значних змін у соціальному
        та політичному житті країни:
        <ul className={styles.markList}>
          <li>
            <b>Давня література (бл. 600-794)</b> - епоха виникнення японської писемності і появи
            перших літописних джерел, включає також так званий Нарський період (710-784)
          </li>
          <li>
            <b>Класична література, або Хейанський період (794-1185)</b> - період, коли столиця
            Японської держави знаходилася в місті Хейан-ке (нині Кіото); значну роль у літературній
            творчості того часу відігравали жінки
          </li>
          <li>
            <b>Середньовічна література (1192-1603)</b> - початок панування військового стану,
            сьогунів, в Японії, період деякого ослаблення літературної творчості
          </li>
          <li>
            <b>Література раннього нового часу, або період Едо (1603-1868)</b> - творчість часу
            сьогуната Токугава, найвищий розквіт японської словесності
          </li>
          <li>
            <b>Сучасна література, або Токійський період (1868—1945)</b> — настав із реставрацією
            Мейдзі та проникненням європейських ідей до раніше закритої країни
          </li>
          <li>
            <b>Післявоєнний період (1945-нині)</b> - період, що послідував за поразкою Японії у
            Другій світовій війні
          </li>
        </ul>
      </p>
      <h2 id="history"><b>Історія</b></h2>
      <h3 id=""><b>Давня література</b></h3>
      <h4 id=""><b>1. Виникнення японської письменності</b></h4>
      <p>
        Писемність виникла Японії із запровадженням китайської писемності і першим знайомством з
        китайської вченістю і літературою, за допомогою корейських учених. До знайомства з
        китайськими письменами у Японії був ніякої писемності. Початок вивчення китайської мови у
        Японії належить до V віці; в 405 кореєць Ван Ін (в японських літописах - Вані 王仁, він
        же 和邇吉師, «добрий вчитель Вані») був запрошений вчителем китайської мови до наслідного
        японського принца - і після того потік вчених з Кореї та Китаю міцно затвердив китайський
        вплив у Японії.
      </p>

      <h4 id=""><b>1. Виникнення японської письменності</b></h4>
      <p>
        Писемність виникла Японії із запровадженням китайської писемності і першим знайомством з
        китайської вченістю і літературою, за допомогою корейських учених. До знайомства з
        китайськими письменами у Японії був ніякої писемності. Початок вивчення китайської мови у
        Японії належить до V віці; в 405 кореєць Ван Ін (в японських літописах - Вані 王仁, він
        же 和邇吉師, «добрий вчитель Вані») був запрошений вчителем китайської мови до наслідного
        японського принца - і після того потік вчених з Кореї та Китаю міцно затвердив китайський
        вплив у Японії.
      </p>
      <h3 id="bunny">fsfsf</h3>
      Зайку бросила хозяйка - Под дождем остался зайка. Со скамейки слезть не мог, Весь до ниточки
      промок.
      <h3 id="bear">Мишка</h3>
      Уронили мишку на пол, Оторвали мишке лапу. Все равно его не брошу - Потому что он хороший.
      <h2 id="raz">Стихи</h2>
    </div>
  )
})

export default History
