import React, { useEffect } from 'react'
import { observer } from 'mobx-react'
import wani from 'sources/images/Wani.jpg'

//components
import { Layout } from 'antd'
// style
import styles from './styles.module.scss'
/* 
const { Header, Sider, Content } = Layout */

const historyObject = {}

const History: React.FC = observer(() => {
  return (
    <div className={styles.wrapper}>
      <nav>
        <h2>Історія японської літератури</h2>
        <ol>
          <li>
            <a href="#period">Періодизація</a>
          </li>
          <li>
            <a href="#history">Історія</a>
          </li>
          <ol>
            <li>
              <a href="#steer">Давня література</a>
            </li>
            <li>
              <a href="#classic">Класична японська література</a>
            </li>
          </ol>
          <li>
            <a href="#spec">Специфічні жанри</a>
          </li>
        </ol>
      </nav>
      <h2 id="period">
        <b>Періодизація</b>
      </h2>
      <p>
        Нижче наведена періодизація японської літератури, прив'язана до значних змін у соціальному
        та політичному житті країни:
        <ul className={styles.markList}>
          <li>
            <b>Давня література (бл. 600-794)</b> - епоха виникнення японської писемності і появи
            перших літописних джерел, включає також так званий Нарський період (710-784)
          </li>
          <li>
            <b>Класична література, або Хейанський період (794-1185)</b> - період, коли столиця
            Японської держави знаходилася в місті Хейан-ке (нині Кіото); значну роль у літературній
            творчості того часу відігравали жінки
          </li>
          <li>
            <b>Середньовічна література (1192-1603)</b> - початок панування військового стану,
            сьогунів, в Японії, період деякого ослаблення літературної творчості
          </li>
          <li>
            <b>Література раннього нового часу, або період Едо (1603-1868)</b> - творчість часу
            сьогуната Токугава, найвищий розквіт японської словесності
          </li>
          <li>
            <b>Сучасна література, або Токійський період (1868—1945)</b> — настав із реставрацією
            Мейдзі та проникненням європейських ідей до раніше закритої країни
          </li>
          <li>
            <b>Післявоєнний період (1945-нині)</b> - період, що послідував за поразкою Японії у
            Другій світовій війні
          </li>
        </ul>
      </p>
      <h2 id="history">
        <b>Історія</b>
      </h2>
      <h3 id="">
        <b>Давня література</b>
      </h3>
      <h4 id="">
        <b>Виникнення японської письменності</b>
      </h4>
      <p>
        <img src={wani} alt='wani' className={styles.image}/>
        Писемність виникла Японії із запровадженням китайської писемності і першим знайомством з
        китайської вченістю і літературою, за допомогою корейських учених. До знайомства з
        китайськими письменами у Японії був ніякої писемності. Початок вивчення китайської мови у
        Японії належить до V віці; в 405 кореєць Ван Ін (в японських літописах - Вані 王仁, він же
        和邇吉師, «добрий вчитель Вані») був запрошений вчителем китайської мови до наслідного
        японського принца - і після того потік вчених з Кореї та Китаю міцно затвердив китайський
        вплив у Японії. У VII столітті Імператор Тендзі (662-671) заснував вищі школи для вивчення
        китайських старожитностей; японські молоді люди вирушали до Китаю вивчати мову та культуру
        країни. Китайська література була частково для Японії тим, чим для європейських літератур
        були грецькі та латинські класики. Запозичивши з Китаю письмена, тобто ієрогліфи, японці
        довго пристосовували їх до особливостей японської мови. Спочатку писемність — особливо проза
        — була китайська, доступна лише вищому, освіченому класу. Китайські ієрогліфи, що становлять
        ідеописальні знаки цілісних слів, а не звуків і складів, стали застосовуватися для вираження
        відповідних японських слів; однакове накреслення ієрогліфа вимовлялося, таким чином,
        по-китайськи і японською, тобто китайський текст читався японськими словами. При збагаченні
        літературної японської мови знадобилося більше письмових знаків — і китайські ієрогліфи
        стали вживатися не як вираз цілісного поняття, а своєму звуковому значенні, як позначення
        складу, частини слова. Це початок переходу до фонетичної японської абетки: ієрогліфи
        використовувалися для запису звучання японських слів. У найдавніших японських літературних
        пам'ятниках це призвело до варварського змішання китайських і японських слів, щоб уникнути
        кращі японські автори віддавали перевагу чистій китайській мові. Поступово почала
        вироблятися японська силабічна абетка маньокана, що остаточно встановилася наприкінці IX
        століття і складається з фонетичного вживання скорочених форм китайських знаків. З введенням
        цієї самостійної фонетичної абетки (на китайському фундаменті) вийшла можливість вільного
        користування японською мовою для літературних цілей, і це призвело до швидкого блискучого
        розквіту японської поезії та прози.
      </p>
      <h4 id="">
        <b>Нарський період</b>
      </h4>
      <p>
        Архаїчний період японської літератури збігається з тим часом, коли відносно небагаті
        резиденції мікадо (імператора) змінювалися з кожним новим правителем, за місцем проживання
        спадкоємця, який жив завжди окремо від правлячого мікадо. Це кочове життя мікадо припинилося
        із затвердженням столиці в Нарі, в провінції Ямато, в 710 р. З цього часу резиденції мікадо,
        завдяки розвитку всіх галузей культури, ставали дедалі розкішнішими і тим самим міцними.
        Тільки через незручне для політичних цілей положення Нари резиденція перенесена була
        спочатку в Нагаоку, а в 794 р. в Кіото (давня назва - Хейан-ке, тобто столиця світу).
        Література, що відноситься до часу резиденції мікадо в Нарі, охоплює собою VIII століття і
        зветься Нарського періоду (історію літератури Японії прийнято поділяти на періоди, що
        відповідають резиденціям мікадо в кожний час). Основні риси цього періоду - розвиток
        китайського впливу, поширення буддизму і відповідно до цього значне зростання літератури, як
        і мистецтва, особливо архітектури (спорудження буддійських храмів і пишних палаців для
        мікадо). Найдавнішими пам'ятками архаїчної японської літератури є пісні, включені до
        стародавніх літописів Кодзікі та Ніхон секі. Пісні ці, що відносяться ймовірно до VI і VII
        століть, є лише археологічний інтерес і далекі від основних рис пізнішої японської поезії —
        схильності до мрійливого споглядання природи, любові до квітів, птахів і т. д. Вони цікаві
        для характеристики первісних японців, як войовничого, самовпевненого, веселого народу,
        хороброго в битвах, що любив бенкети з застільними піснями, урочистості з вітальними та
        вітальними піснями, що жив наївними, простими почуттями. Такий загальний характер японської
        архаїчної поезії, в якій переважають святкові, застільні, войовничі, похоронні, жартівливі
        і, головним чином, любовні пісні, що виражають наївну чуттєвість, яка іноді доходить до
        цинізму. Багато пісні — особливо військові — відносяться до легендарної історії початку
        японської монархії та приписуються зазвичай імператорам та різним знатним особам; багато
        пісень пов'язують з ім'ям легендарного засновника японської монархії (660 р.), імператора
        Дзимму; одна з найкращих старих пісень вважається твором мікадо Одзіна і складена — за
        словами літописів — у 282 році (Імператор Одзін, який обрав для свого гарему красуню
        Камі-нага-хіме, поступається її синові, який покохав її), але поетичні гідності цієї пісні,
        витриманість і витримка тонкість алегоричної форми свідчить про належність її до пізнішого
        часу — мабуть до VI віці. Інші твори прози Нарського періоду: семміо, або мікотонорі (яп.
        詔) - едикти імператорів японською мовою при вступі на престол або відмові від престолу, при
        призначенні нових міністрів, з нагоди смерті видатних людей, для упокорення заколотів і т.
        д.; вони складені в урочистому тоні норіто і рясніють риторичними прикрасами. Потім йдуть
        фудоки – топографічні описи японських провінцій. З них найбільш відомий «Ідзумо-фудокі»,
        вид. в 733 р., що складається, загалом, із сухого фактичного викладу, але з включеними до
        тексту поетичними легендами та старими міфами. З удзибумі, тобто фамільних хронік окремих
        сімей, збереглася лише одна, сім'ї Такахасі Такахасі удзібумі (яп. 高橋氏文). Вона написана
        в стилі семміо та кодзики.
      </p>
      <h3 id="classic">
        <b>Класична японська література (794-1185)</b>
      </h3>
      <p>
        Другий період японської літератури зветься Хейанского, за назвою міста Хэйан-кё («місто
        світу», сучасний Кіото), куди 794 р. було перенесено столиця імперії з Нари. Хейанський
        період продовжувався з 800 до 1186 і вважається класичним. Високий розквіт національної
        літератури відбувався у зв'язку із впливом китайської літератури та буддизму. Маса
        японського народу залишалася ще у невігластві; література цього періоду - аристократична, її
        представники - члени вищого придворного кола. Особливість періоду полягає у переважанні
        жіночої творчості. Найголовніші твори цієї епохи написані жінками, які займали тоді чільне і
        цілком самостійне вільне становище. Витончена література була майже в руках жінок (чоловіки
        вивчали китайську вченість); тому її характер — вишуканий і сімейно-благопристойний, на
        противагу порнографічній японській белетристиці XVIII і XIX століть.
      </p>
      <h4 id="">
        <b>Поезія</b>
      </h4>
      <p>
        Поезія Хейанського періоду представлена ​​збіркою «Кокінсю», складеною за дорученням мікадо
        Дайго і виданою 922 року. У ньому близько 1100 віршів, поділених на такі ж рубрики, як у
        «Ман'єсі»; більша їх частина – танка. За багатством змісту та достоїнствами окремих віршів
        «Кокінсю» стоїть нижче «Ман'ю»; в ньому безліч танка, написаних на задані теми при поетичних
        турнірах і хизуються зовнішньою обробкою форми, дотепною грою слів. Але саме цьому збірник
        «Кокінсю» завдячує своєю великою популярністю: вивчення його в XI столітті було обов'язковим
        для освічених людей, особливо для дівчат. Згодом «Кокінсю» більше наслідували, ніж
        «Ман'єсю».
      </p>
      <h2 id="spec">
        <b>Специфічні жанри</b>
      </h2>
      <p>
        <ul>
          <li>Вака - японський середньовічний поетичний жанр.</li>
          <li>
            Танка — 31-складова п'ятирядкова японська віршована форма (основний вид японської
            ліричної феодальної поезії), що є різновидом жанру вака (яп. 和歌 вака, «пісні Ямато»).
          </li>
          <li>
            Ренга (яп. 連歌, «букв. спільна поетична творчість») - жанр старовинної японської
            поезії. Ренга складалася щонайменше двох строф (ку, яп. 句); звичайно ж строф було
            набагато більше. Перша, що «відкриває» строфа ренга (5-7-5 складів) називалися хокку,
            саме вона свого часу послужила основою для створення самостійного жанру японських
            тривіршів-хайку.
          </li>
          <li>
            Хайку (яп. 俳句) - жанр традиційної японської ліричної поезії вака, відомий з XIV
            століття. У самостійний жанр ця поезія, що мала тоді назву хокку, виділилася у XVI
            столітті; сучасну назву було запропоновано у XIX столітті поетом Масаока Сіки.
          </li>
          <li>
            Дзуйхіцу (яп. 随筆, за пензлем) — це жанр японської короткої прози, у якому автор
            записує усе, що спадає йому на думку, не замислюючись у тому, наскільки це
            «літературно». Дзуйхіцу може розповідати про якийсь раптовий спогад, що спала на думку,
            побаченої побутової сценки. До класики дзуйхіцу відносяться «Записки біля узголів'я» Сей
            Сенагон (кінець X століття), «Записки з келії» Камо-но Темея (1153—1216), «Записки від
            нудьги» Йосіди Кенко (бл. 1330), «Збирання та спалювання »Араї Хакусекі (бл. 1716-1717).
          </li>
        </ul>
      </p>
    </div>
  )
})

export default History
